<template>
    <vs-popup class="holamundo" style="line-height:2.5"  :title="__('Help')" :active="show" @close="$emit('close')">
      <p>
        راهنما: جهت مشاهده ی راهنما (پنجره ی فعلی) از این دکمه استفاده نمایید.
        <br>
        ثبت رکورد جدید: جهت ثبت یک رکورد جدید و افزودن آن به این لیست از این دکمه استفاده کنید.با کلیک روی این دکمه به فرم مربوطه هدایت می شوید.
        <br>
        پرینت: جهت چاپ تمام اطلاعات موجود در گرید از این دکمه استفاده کنید. بنابراین با فیلتر اطلاعات گرید، اطلاعات فیلتر شده را میتوان پرینت گرفت.
        <br>
        حذف چندتایی: در صورت تمایل به حذف چندتایی رکورد ها، ابتدا رکوردهای مورد نظر را در گرید مارک دار نمایید و سپس از این دکمه برای حذف استفاده نمایید.
        <br>
        خروجی: جهت تهیه ی خروجی اکسل و یا پی دی اف از این دکمه و انتخاب نوع خروجی مورد نظر از لیست باز شده،استفاده نمایید..
        <br>
        تنظیمات: جهت تنظیمات دلخواه گرید مانند: نمایش یا عدم نمایش ستونها، رنگ بندی، تعداد رکوردهای قابل نمایش در صفحه و.. از این دکمه استفاده نمایید .
        <br>
        تمام صفحه: برای نمایش کلیه اطلاعات گرید در یک صفحه و یا صفحه بندی اطلاعات گرید از ای دکمه استفاده نمایید. با هربار کلیک روی این دکمه یکی از حالت های تمام صفحه و صفحه بندی اطلاعات انتخاب می شود.
        <br>
        فیلتر: در قسمت بالایی لیست فیلترهایی جهت پیدا کردن سریع تر رکور مورد نظر وجود دارد.با تنظیم فیلتر و کلیک روی دکمه ی جست و جو می توانید به رکورد مورد نظر دسترسی داشته باشید.هم چنین با کلیک بر روی دکمه ی نوسازی می توانید فیلترها را به حالت ابتدایی بازگردانید.
        <br>
        ویرایش: جهت ویرایش مشخصات ثبت شده ، با کلیک بر روی این دکمه به فرم مربوطه هدایت خواهید شد.به صورت پیش فرض اطلاعات از قبل ثبت شده روی فرم ویرایش مینشیند.
        <br>
        جزئیات: جهت نمایش جزئیات کامل هر رکورد از این دکمه استفاده نمایید.
      </p>
    </vs-popup>
</template>
<script>
export default {
    props:["show"]
}
</script>
